# MEPSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurve..::..MEPSystem Property
MEPCurve Class See Also
---
The system of the MEP curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPSystem MEPSystem { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MEPSystem As MEPSystem
	Get
```

Visual C++
---
```text
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
```

# Remarks
Returns the system of this MEP curve. If the curve does not belong to any systems, the value will be nullNothingnullptra null reference (Nothing in Visual Basic). If the curve belongs to more than one system, the first available value is returned.
# See Also
MEPCurve Class
Autodesk.Revit.DB Namespace